var message = 'Hello world! 1'

// Регист важен message и Message это разные переменные:
var Message = 'Hello world! 2'

// обьявили пустую переменную
var Messg = ''

// Варианты именования переменных:
var helloMessage = 'Hello again 1' // предпочтительный
var hello_message = 'Hello again 2' // лучше не называть

// В качестве названий переменных можно использовать следуюшие символы:
var $ = 'Dollar'
var _ = 'Underscore'

// переменные можно именовать с цифрами:
var message2 = 'Hello world message 2'  // предпочтительный вариант ковычек
var message3 = "Hello world message 3"

// можно объявить переменную "сообщение" и присвоить ей значение 'Сообщение!'
// русские символы в переменных допустимы но не желательны
var сообщение = 'Сообщение!'

// Затем можно эту переменную передавать в какие-ниьбдуь функции, например:
console.log(сообщение)